#include "types.h"
/*
trapframe is the page where we store user cpu register values
before cpu start to execute some other process, so that cpu can 
start from the point where it left
*/
struct trapframe {
  /*   0 */ uint64 kernel_satp;   // kernel page table
  /*   8 */ uint64 kernel_sp;     // top of process's kernel stack
  /*  16 */ uint64 kernel_trap;   // usertrap()
  /*  24 */ uint64 epc;           // saved user program counter
  /*  32 */ uint64 kernel_hartid; // saved kernel tp
  /*  40 */ uint64 ra;
  /*  48 */ uint64 sp;
  /*  56 */ uint64 gp;
  /*  64 */ uint64 tp;
  /*  72 */ uint64 t0;
  /*  80 */ uint64 t1;
  /*  88 */ uint64 t2;
  /*  96 */ uint64 s0;
  /* 104 */ uint64 s1;
  /* 112 */ uint64 a0;
  /* 120 */ uint64 a1;
  /* 128 */ uint64 a2;
  /* 136 */ uint64 a3;
  /* 144 */ uint64 a4;
  /* 152 */ uint64 a5;
  /* 160 */ uint64 a6;
  /* 168 */ uint64 a7;
  /* 176 */ uint64 s2;
  /* 184 */ uint64 s3;
  /* 192 */ uint64 s4;
  /* 200 */ uint64 s5;
  /* 208 */ uint64 s6;
  /* 216 */ uint64 s7;
  /* 224 */ uint64 s8;
  /* 232 */ uint64 s9;
  /* 240 */ uint64 s10;
  /* 248 */ uint64 s11;
  /* 256 */ uint64 t3;
  /* 264 */ uint64 t4;
  /* 272 */ uint64 t5;
  /* 280 */ uint64 t6;
};


/*
it is similar to the trapframe, but trapframe is use let say if cpu is executing the instructions
that are present in the user space and then cpu has to pause the execution of that process
because may be it start execute the another process or it just start executing kernel due to exception
then in that case we save the user's cpu register value but context is use when let say cpu is
executing the kernel code then it pause the execution because it start to execute the another process
then in that case it save some register's value that are used during the kernel execution.
*/
struct context {
  uint64 ra;
  uint64 sp;
  uint64 s0;
  uint64 s1;
  uint64 s2;
  uint64 s3;
  uint64 s4;
  uint64 s5;
  uint64 s6;
  uint64 s7;
  uint64 s8;
  uint64 s9;
  uint64 s10;
  uint64 s11;
};



// this is for the state of the process
enum procstate { UNUSED, USED, SLEEPING, RUNNABLE, RUNNING, ZOMBIE};

// per process state
struct proc{
     char name[16]; // process name
     int pid; // process id

     enum procstate state; // Process State

     struct trapframe *trapframe;
     struct context context;
};